### `Q1`. List any five functions of the pandas library with execution.

In [1]:
import pandas as pd

<b>1. `read_csv`</b>: This function is used to read a CSV file into a pandas DataFrame.

In [2]:
titanic = pd.read_csv("https://raw.githubusercontent.com/datasciencedojo/datasets/master/titanic.csv")

<b>2. `head()`</b>: This function is used to display the first n rows of a pandas DataFrame.

In [3]:
titanic.head()

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

<b>3. `describe()`</b>:  This function is used to generate descriptive statistics for a pandas DataFrame.<b>2. `head()`</b>:

In [4]:
titanic.describe()

,PassengerId,Survived,Pclass,Age,SibSp,Parch,Fare
count,891.000000,891.000000,891.000000,714.000000,891.000000,891.000000,891.000000
mean,446.000000,0.383838,2.308642,29.699118,0.523008,0.381594,32.204208
std,257.353842,0.486592,0.836071,14.526497,1.102743,0.806057,49.693429
min,1.000000,0.000000,1.000000,0.420000,0.000000,0.000000,0.000000
25%,223.500000,0.000000,2.000000,20.125000,0.000000,0.000000,7.910400
50%,446.000000,0.000000,3.000000,28.000000,0.000000,0.000000,14.454200
75%,668.500000,1.000000,3.000000,38.000000,1.000000,0.000000,31.000000
max,891.000000,1.000000,3.000000,80.000000,8.000000,6.000000,512.329200

<b>4. `value_counts()`</b>: returns a Pandas Series containing the counts of unique values.

In [5]:
titanic['Fare'].value_counts()

8.0500     43
13.0000    42
7.8958     38
7.7500     34
26.0000    31
           ..
35.0000     1
28.5000     1
6.2375      1
14.0000     1
10.5167     1
Name: Fare, Length: 248, dtype: int64

<b>5. `info()`</b>:The info() method prints information about the DataFrame. The information contains the number of columns, column labels, column data types, memory usage, range index, and the number of cells in each column (non-null values)

In [6]:
 titanic.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 12 columns):
 #   Column       Non-Null Count  Dtype
---  ------       --------------  -----
 0   PassengerId  891 non-null    int64
 1   Survived     891 non-null    int64
 2   Pclass       891 non-null    int64
 3   Name         891 non-null    object
 4   Sex          891 non-null    object
 5   Age          714 non-null    float64
 6   SibSp        891 non-null    int64
 7   Parch        891 non-null    int64
 8   Ticket       891 non-null    object
 9   Fare         891 non-null    float64
 10  Cabin        204 non-null    object
 11  Embarked     889 non-null    object
dtypes: float64(2), int64(5), object(5)
memory usage: 83.7+ KB

### `Q2`. Given a Pandas DataFrame df with columns 'A', 'B', and 'C', write a Python function to re-index the DataFrame with a new index that starts from 1 and increments by 2 for each row.

In [7]:
def python_fun(df):
    new_index = pd.RangeIndex(start=1, step=2, stop=len(df)*2)
    df.index = new_index
    return df

In [8]:
df = pd.DataFrame({'A': [1, 2, 3], 'B': [4, 5, 6], 'C': [7, 8, 9]})
reindexed_df = python_fun(df)
reindexed_df

   A  B  C
1  1  4  7
3  2  5  8
5  3  6  9

### `Q3`. You have a Pandas DataFrame df with a column named 'Values'. Write a Python function that terates over the DataFrame and calculates the sum of the first three values in the 'Values' column. The function should print the sum to the console.
- For example, if the 'Values' column of df contains the values [10, 20, 30, 40, 50], your function should
calculate and print the sum of the first three values, which is 60.

In [9]:
def sum_first_three(df):
    values = df['Values'][:3]
    total = sum(values)
    print(f"The sum of the first three values in the {list(values)} column is: {total}")

df = pd.DataFrame({'Values': [10, 20, 30, 40, 50]})
sum_first_three(df)

The sum of the first three values in the [10, 20, 30] column is: 60

### `Q4`. Given a Pandas DataFrame df with a column 'Text', write a Python function to create a new column 'Word_Count' that contains the number of words in each row of the 'Text' column.

In [10]:
def word_count_fun(df):
    df['Word_Count'] = df['Text'].str.split().str.len()

In [11]:
df = pd.DataFrame({'Text': ['i want to data scientist course', ' learing from pwskiils']})
word_count_fun(df)
print(df)

                              Text  Word_Count
0  i want to data scientist course           6
1            learing from pwskiils           3

### `Q5`. How are `DataFrame.size` and `DataFrame.shape` different?

- The `DataFrame.size` attribute returns the total number of elements in the DataFrame, which is equivalent to the product of the number of rows and columns. It returns a single integer value that represents the total number of elements in the DataFrame.

- The `DataFrame.shape` attribute, on the other hand, returns a tuple that contains the number of rows and columns in the DataFrame. The first element of the tuple is the number of rows, and the second element is the number of columns. It returns a tuple of integers that represents the dimensions of the DataFrame.

In [12]:
titanic.size #returns the total number of elements in the DataFrame

10692

In [13]:
titanic.shape  #returns a tuple that contains the number of rows and columns in the DataFrame

(891, 12)

### `Q6`. Which function of pandas do we use to read an excel file?

- To read an Excel file in pandas, you can use the `read_excel()` function. This function is part of the pandas library and can read Excel files in various formats, including `.xlsx` and `.xls`.

In [14]:
df = pd.read_excel("LUSID Excel - Setting up your market data.xlsx")
df.head()

,Unnamed: 0,Unnamed: 1,Unnamed: 2,Unnamed: 3,Unnamed: 4,Unnamed: 5,Unnamed: 6,Unnamed: 7,Unnamed: 8,Unnamed: 9
0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,NaN,NaN,NaN,Datetimes in LUSID,NaN,NaN,NaN,NaN,NaN,NaN
2,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,NaN,NaN,NaN,This sheet allows you to format datetimes for...,NaN,NaN,NaN,NaN,NaN,NaN
4,NaN,NaN,NaN,If you have any questions please visit our:,NaN,NaN,NaN,NaN,NaN,NaN

### `Q7`. You have a Pandas DataFrame df that contains a column named 'Email' that contains email addresses in theformat `username@domain.com`. Write a Python function that creates a new column 'Username' in df that contains only the username part of each email address. The username is the part of the email address that appears before the '@' symbol. For example, if the email address is 'john.doe@example.com', the 'Username' column should contain 'john.doe'. Your function should extract the username from each email address and store it in the new 'Username' column.

In [15]:
def extract(df):
    df['Username'] = df['Email'].str.split('@').str[0]
    return df

In [16]:
df = pd.DataFrame({
    'Email': ['john.doe@example.com', 'utakrsh@example.com']
})

df = extract(df)
df

                  Email  Username
0  john.doe@example.com  john.doe
1   utakrsh@example.com   utakrsh

### `Q8`. You have a Pandas DataFrame df with columns 'A', 'B', and 'C'. Write a Python function that selects all rows where the value in column 'A' is greater than 5 and the value in column 'B' is less than 10. The function should return a new DataFrame that contains only the selected rows.
- For example, if df contains the following values:
    - A B C
    - 0 3 5 1
    - 1 8 2 7
    - 2 6 9 4
    - 3 2 3 5
    - 4 9 1 2
- Your function should select the following rows: A B C
    - 1 8 2 7
    - 4 9 1 2
- The function should return a new DataFrame that contains only the selected rows.

In [17]:
def row_select(df):
    select_df = df[(df['A'] > 5) & (df['B'] < 10)]
    return select_df

In [18]:
df = pd.DataFrame({
    'A': [3, 8, 6, 2, 9],
    'B': [5, 2, 9, 3, 1],
    'C': [1, 7, 4, 5, 2]
})

new_df = row_select(df)
new_df

   A  B  C
1  8  2  7
2  6  9  4
4  9  1  2

### `Q9`. Given a Pandas DataFrame df with a column 'Values', write a Python function to calculate the mean, median, and standard deviation of the values in the 'Values' column.

In [19]:
def stat(df):
    mean = df['Values'].mean()
    median = df['Values'].median()
    std = df['Values'].std()
    return mean ,median,std

In [20]:
df = pd.DataFrame({'Values': [1,2,3,4,5,6,7,8,9,10]})
mean , median , std = stat(df)

print('Mean:', mean)
print('Median:', median)
print('Standard Deviation:', std)

Mean: 5.5
Median: 5.5
Standard Deviation: 3.0276503540974917

### `Q10`. Given a Pandas DataFrame df with a column 'Sales' and a column 'Date', write a Python function to create a new column 'MovingAverage' that contains the moving average of the sales for the past 7 days for each row in the DataFrame. The moving average should be calculated using a window of size 7 and should include the current day.

In [21]:
def fun_moving_avarage(df):
    df['MovingAverage'] = df['Sales'].rolling(window=7,min_periods =1).mean()
    return df

In [22]:
df = pd.DataFrame({
    'Date': pd.date_range('2023-01-01', periods=10),
    'Sales': [10, 20, 30, 40, 50, 60, 70, 80, 90, 100]
})

df = fun_moving_avarage(df)
print(df)

        Date  Sales  MovingAverage
0 2023-01-01     10           10.0
1 2023-01-02     20           15.0
2 2023-01-03     30           20.0
3 2023-01-04     40           25.0
4 2023-01-05     50           30.0
5 2023-01-06     60           35.0
6 2023-01-07     70           40.0
7 2023-01-08     80           50.0
8 2023-01-09     90           60.0
9 2023-01-10    100           70.0

### `Q11`. You have a Pandas DataFrame df with a column 'Date'. Write a Python function that creates a new column 'Weekday' in the DataFrame. The 'Weekday' column should contain the weekday name (e.g. Monday, Tuesday) corresponding to each date in the 'Date' column.
- For example, if df contains the following values:
    - Date
    - 0 2023-01-01
    - 1 2023-01-02
    - 2 2023-01-03
    - 3 2023-01-04
    - 4 2023-01-05
- Your function should create the following DataFrame:
    - Date Weekday
    - 0 2023-01-01 Sunday
    - 1 2023-01-02 Monday
    - 2 2023-01-03 Tuesday
    - 3 2023-01-04 Wednesday
    - 4 2023-01-05 Thursday
- The function should return the modified DataFrame.

In [23]:
def week_Day(df):
    df['weekday'] = pd.to_datetime(df['Date']).dt.day_name()
    return df

In [24]:
df = pd.DataFrame({'Date':['2023-01-01','2023-01-02','2023-01-03','2023-01-04','2023-01-05']})
df = week_Day(df)
print(df)

         Date    weekday
0  2023-01-01     Sunday
1  2023-01-02     Monday
2  2023-01-03    Tuesday
3  2023-01-04  Wednesday
4  2023-01-05   Thursday